'''
需要定义列表保存从1到10000的数据,怎么做?

'''
'''---------------------- 普通方案 ----------------------'''
# # 1.定义空列表
# l = []
# # 2.循环添加数据
# for ele in range(1,10001):
#         if ele %2==0:
#     l.append(ele)
#
# print(l)

'''---------------------- 列表推导式 ----------------------'''
# 1.创建包含1到10000的列表
# l = [ele for ele in range(1,10001)]
# print(l)

# 2.创建包含1到10000中所有偶数的列表
# l = [ele for ele in range(1,10001) if ele%2==0]
# print(l)

# 3.创建嵌套列表(列表每个元素是两个元素的元组)
# l = [(1,2),(2,4),(3,6)..(100,200)]
# l = [(ele,ele*2) for ele in range(1,101)]
# print(l)

# 4.创建嵌套列表(列表每个元素是三个元素的元组)
# l = [(1,2,3),(2,4,6),(3,6,9)..(100,200,300)]
l = [(ele,ele*2,ele*3) for ele in range(1,101)]
print(l)




