'''
输入年月日如:20180325
输入在当前年的哪一天(第84天)

31 28 25

分析:
1.输入年月日(认为你输入的年月日满足条件)
2.从输入的年月日字符串中分隔出 年 月 日
3.根据年把当前年 每个月对应的天数 定义出来(平年和闰年)
4.循环从1月份到当前月 把之前每个月对应的天数加起来
5.天数再加上当前月已经经过的天数
'''
# 1.输入年月日(认为你输入的年月日满足条件)
date = input('请输入年月日')
# 2.从输入的年月日字符串中分隔出 年 月 日
year = int(date[:4])
month = int(date[4:6])
day = int(date[6:])
# print(year,month,day)
# 3.根据年把当前年 每个月对应的天数 定义出来(平年和闰年)
monthDays = [31,28,31,30,31,30,31,31,30,31,30,31]
# 如果是闰年 修改第二月天数
if (year%4==0 and year%100!=0) or (year%400==0):
    monthDays[1] = 29

# print(monthDays)
# 定义变量保存总天数
totalDay = 0
# 4.循环从1月份到当前月 把之前每个月对应的天数加起来
for ele in range(1,month):# 123
    totalDay+=monthDays[ele-1]

# 5.天数再加上当前月已经经过的天数
totalDay+=day
print('总天数:{}'.format(totalDay))