'''--------------------- break ---------------------'''
'''
机器人找到箱子中的可乐就停下来
'''
# box = ['酸奶','积木','可乐','盒子','矿泉水']
# for ele in box:
#     print(ele)
#     if ele=='可乐':
#         # 找到了可乐
#         break

'''
找到第2瓶可乐停下来
'''
# box = ['酸奶', '积木', '可乐', '盒子', '矿泉水', '可乐', '脉动']
# 记录找到的可乐个数
# count = 0
# for ele in box:
#     print(ele)
#     # 找到第二瓶可乐停下来
#     if ele == '可乐':
#         count += 1
#         if count==2:
#             # 找到了第二瓶可乐
#             break

'''--------------------- continue ---------------------'''
'''
找到除了可乐之外的其它所有物品
'''
box = ['酸奶', '积木', '可乐', '盒子', '矿泉水', '可乐', '脉动']
for ele in box:
    if ele=='可乐':
        # 不需要print这个商品,继续下一次循环
        continue
    print(ele)
