'''
自动组包
自动解包
交换数据
格式化输出
让列表不可被修改,保护数据安全

'''
'''--------------------- 自动组包 ---------------------'''
# 定义多个变量
# a,b = 10,20
# t = ('酸奶','可乐','矿泉水')
# 组包
# g = 30,40,50
# print(type(g))
# print(g)

'''--------------------- 自动解包 ---------------------'''
# t = ('酸奶','可乐','矿泉水')
# 解包
# a,b,c = t
# print(a,b,c)

'''--------------------- 交换数据 ---------------------'''
a = 10
b = 20
# 想交换a和b
# tmp = a
# a = b
# b = tmp
# print(a,b)
# 组包 b,a
# 解包 a,b = (20,10)
a,b = b,a# (20,10)
# print(a,b)

'''--------------------- 格式化输出 ---------------------'''
t = ('ur机器人',5)
# print('机器人名字:%s,机器人载荷:%d'%t)


'''--------------------- 让列表不可被修改,保护数据安全 ---------------------'''
joints = [-0.107,-0.57773,0.38707,-102.49585,0.32462,-178.53554]
# 不希望修改数据
t = tuple(joints)
print(t)
l = list(t)
print(l)

