'''
分析:
1.打印九行*(*不能参与运算)
2.将*替换成最终的乘法口诀
'''
'''--------------------- 打印* ---------------------'''
# index = 1
# while index < 10:
#     print('*'*index)
#     index += 1

'''--------------------- 嵌套循环打印* ---------------------'''

# row = 1
# while row < 10:
#     col = 1
#     while col <= row:
#         print('*',end='')# 自动带换行
#         col += 1
#     # 当前行已经打印完成,需要换行
#     print()
#     row += 1


'''--------------------- 替换*为真正的乘法口诀 ---------------------'''
row = 1
while row < 10:
    col = 1
    while col <= row:
        print('{} * {} = {}\t'.format(col,row,col*row),end='')# 自动带换行
        col += 1
    # 当前行已经打印完成,需要换行
    print()
    row += 1