'''
编写一个程序计算个人所得税（以下为个人所得税税率表，3500元起征）：

应纳税所得额(含税)                        税率(%)
不超过1500元的                              3
超过1500元至4,500元的部分                   10
超过4,500元至9,000元的部分                  20
超过9,000元至35,000元的部分                 25
超过35,000元至55,000元的部分                30
超过55,000元至80,000元的部分                35
超过80,000元的部分                          45


3500
4000-3500=500
6000-3500=2500  1500  45 1000 100

85000=3500=81500        1500*0.03+3000*0.1+4500*0.2+26000*0.25+20000*0.3+35000*0.35+1500*0.45
'''
# 输入收入
sallery = int(input('请输入收入:'))
# 计算应该交税收入
sallery -= 3500
tax = 0
if sallery>=80000:
    tax = 1500 * 0.03 + 3000 * 0.1 + 4500 * 0.2 + 26000 * 0.25 + 20000 * 0.3 + 25000 * 0.35+(sallery-80000)*0.54
elif sallery>=55000:
    tax = 1500 * 0.03 + 3000 * 0.1 + 4500 * 0.2 + 26000 * 0.25 + 20000 * 0.3+(sallery-55000)*0.35
elif sallery>=35000:
    tax = 1500 * 0.03 + 3000 * 0.1 + 4500 * 0.2 + 26000 * 0.25+(sallery-35000)*0.3
elif sallery>=9000:
    tax = 1500 * 0.03 + 3000 * 0.1 + 4500 * 0.2 +(sallery-9000)*0.25
elif sallery>=4500:
    tax = 1500 * 0.03 + 3000 * 0.1 +(sallery-4500)*0.2
elif sallery>=1500:
    tax = 1500 * 0.03 +(sallery-1500)*0.1
elif sallery>0:
    tax = (sallery-1500)*0.03
else:
    print('不需要交税')

print(tax)



