# str = '苹果梨香蕉橘子可乐'
'''---------------------- find ----------------------'''
# 从左向右查找梨的位置 返回索引
# index = str.find('梨')
# print(index)
# 返回字符串第一个字符索引
# index = str.find('香蕉')
# print(index)

'''---------------------- rfind ----------------------'''
# str = '苹果梨香蕉橘子可乐梨西红柿'
# index = str.find('梨')
# print(index)
# 从后往前查找  找到就停下来
# index = str.rfind('梨')
# print(index)

'''---------------------- replace ----------------------'''
str = '苹果梨香蕉橘子可乐梨香蕉西红柿'
# 替换香蕉->皇帝蕉
# 替换完成之后 返回一个新的字符串
# 默认 替换所有符合条件的字符串
# 可以指定替换的count 限制替换的次数
newStr = str.replace('香蕉','皇帝蕉',1)
print(newStr)
